In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame({'key1': ['a', 'a', 'b', 'b', 'a'],
                  ......:'key2':['one', 'two', 'one', 'two', 'one'],
                  ......:'data1':np.random.randn(5),
                  ......:'data2':np.random.randn(5)})

In [4]:
df

  key1 key2     data1     data2
0    a  one  0.179316  0.053750
1    a  two  1.384056  0.883227
2    b  one  0.021267  0.806421
3    b  two  0.724582  0.175894
4    a  one -0.511434  1.103546

In [5]:
grouped = df['data1'].groupby(df['key1'])

In [6]:
grouped

In [7]:
grouped.mean()

key1
a    0.350646
b    0.372925
Name: data1, dtype: float64

In [8]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [9]:
means

key1  key2
a     one    -0.166059
      two     1.384056
b     one     0.021267
      two     0.724582
Name: data1, dtype: float64

In [10]:
means.unstack()

key2       one       two
key1
a    -0.166059  1.384056
b     0.021267  0.724582

In [15]:
states = np.array(['Los Santos', 'Las Venturas', 'Las Venturas', 'Los Santos', 'Los Santos'])

In [16]:
years = np.array([2004, 2004, 2005, 2004, 2004])

In [17]:
df['data1'].groupby([states, years]).mean()

Las Venturas  2004    1.384056
              2005    0.021267
Los Santos    2004    0.130821
Name: data1, dtype: float64

In [24]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one  -0.166059  0.578648
     two   1.384056  0.883227
b    one   0.021267  0.806421
     two   0.724582  0.175894

In [25]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [28]:
pieces = dict(list(df.groupby('key1')))

In [29]:
pieces['b']

  key1 key2     data1     data2
2    b  one  0.021267  0.806421
3    b  two  0.724582  0.175894

In [30]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [32]:
grouped = df.groupby(df.dtypes, axis=1)

/tmp/ipykernel_21564/521057107.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  grouped = df.groupby(df.dtypes, axis=1)

In [35]:
df.groupby('key1')['data1']
df.groupby('key1')[['data2']]

In [36]:
df['data1'].groupby(df['key1'])
df[['data2']].groupby(df['key1'])

In [37]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one   0.578648
     two   0.883227
b    one   0.806421
     two   0.175894

In [38]:
s_grouped = df.groupby(['key1', 'key2'])['data2']

In [39]:
s_grouped

In [40]:
s_grouped.mean()

key1  key2
a     one     0.578648
      two     0.883227
b     one     0.806421
      two     0.175894
Name: data2, dtype: float64

In [41]:
people = pd.DataFrame(np.random.randn(5, 5),
                      ......: columns=['a', 'b', 'c', 'd', 'e'],
                      ......: index=['Nick', 'Malik', 'Kletus', 'Mag', 'Andy'])

In [42]:
people.iloc[2:3, [1, 2]] = np.nan # Acrescenta alguns valores NA

In [43]:
people

               a         b         c         d         e
Nick   -0.304865 -0.733729  0.507323  0.264393  1.249444
Malik  -1.289625  0.419323  1.094837  0.795999  0.533186
Kletus -0.110745       NaN       NaN  1.196168 -0.550105
Mag    -0.050762  0.563889  0.818276  2.065096 -0.008417
Andy    0.567737 -0.295900  0.367347  0.038094  0.329283

In [44]:
mapping = {'a':'Black', 'b':'Black', 'c':'Green',
          ......:'d': 'Purple', 'e': 'Black', 'f': 'yellow'}

In [45]:
by_column = people.groupby(mapping, axis=1)

/tmp/ipykernel_21564/3111365124.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  by_column = people.groupby(mapping, axis=1)

In [46]:
by_column.sum()

           Black     Green    Purple
Nick    0.210850  0.507323  0.264393
Malik  -0.337116  1.094837  0.795999
Kletus -0.660850  0.000000  1.196168
Mag     0.504710  0.818276  2.065096
Andy    0.601119  0.367347  0.038094

In [47]:
map_series = pd.Series(mapping)

In [48]:
map_series

a     Black
b     Black
c     Green
d    Purple
e     Black
f    yellow
dtype: object

In [49]:
people.groupby(map_series, axis=1).count()

/tmp/ipykernel_21564/1833935060.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  people.groupby(map_series, axis=1).count()

        Black  Green  Purple
Nick        3      1       1
Malik       3      1       1
Kletus      2      0       1
Mag         3      1       1
Andy        3      1       1

In [51]:
people.groupby(len).sum()

          a         b         c         d         e
3 -0.050762  0.563889  0.818276  2.065096 -0.008417
4  0.262871 -1.029629  0.874670  0.302487  1.578727
5 -1.289625  0.419323  1.094837  0.795999  0.533186
6 -0.110745  0.000000  0.000000  1.196168 -0.550105

In [52]:
key_list = ['one', 'one', 'one', 'two', 'two']

In [53]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 two -0.050762  0.563889  0.818276  2.065096 -0.008417
4 one -0.304865 -0.733729  0.507323  0.264393  1.249444
  two  0.567737 -0.295900  0.367347  0.038094  0.329283
5 one -1.289625  0.419323  1.094837  0.795999  0.533186
6 one -0.110745       NaN       NaN  1.196168 -0.550105

In [54]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
                                     ......: [1, 3, 5, 1, 3]],
                                     ......: names=['cty', 'tenor'])

In [55]:
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)

In [56]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      0.760270 -0.226584  0.927078 -0.923723 -0.498974
1     -0.960258 -1.554328 -0.151187  0.058891 -1.510014
2     -0.633126  0.597030  0.216281 -1.293200 -0.805211
3     -0.416327  0.381170 -1.122725 -0.260085 -0.305820

In [57]:
hier_df.groupby(level='cty', axis=1).count()

/tmp/ipykernel_21564/2333815484.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [58]:
df

  key1 key2     data1     data2
0    a  one  0.179316  0.053750
1    a  two  1.384056  0.883227
2    b  one  0.021267  0.806421
3    b  two  0.724582  0.175894
4    a  one -0.511434  1.103546

In [59]:
grouped = df.groupby('key1')

In [60]:
grouped['data1'].quantile(0.9)

key1
a    1.143108
b    0.654251
Name: data1, dtype: float64

In [65]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  0.350646  0.959289 -0.511434 -0.166059  0.179316  0.781686
b      2.0  0.372925  0.497319  0.021267  0.197096  0.372925  0.548754

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     1.384056   3.0  0.680174  0.553571  0.053750  0.468488  0.883227
b     0.724582   2.0  0.491158  0.445850  0.175894  0.333526  0.491158


           75%       max
key1
a     0.993386  1.103546
b     0.648789  0.806421

In [74]:
functions = ['count', 'mean', 'max']